#!/usr/bin/env python
# -*- coding: utf-8 -*-

Start_Mess = '''
    Ласкаво просимо у базу даних Hay Day
    Тут знаходиться багато різної інформації про гру, і постійно поповняється.
    Як це працює спитаєте ви ?
    Прочитавши цей текст до кінця , нажимаєте Enter
    опісля вибираєте пункт який вас цікавить, нажимаєте відповідну цифру і знову Enter
    Опля , відкрилось вікно з новим змістом відповідної теми і т.д і т.п. :)'''

go = '''Давіть клавішу Enter щоб продовжити. '''
conty = 'Виберіть бажаний режим і жміть Enter'
contb = 'Давіть Enter щоб повернутись у попереднє меню'
mess_error = 'Веденя невірне, повторіть спробу'

select_mode = ('''
    1.Простий режим - Проста і стисла інформація
    2.Розширений режим - Багато інформації + калькулятор обрахунку''')
contents = ('''
    1.Городні рослини
    2.Дерева та кущі
    3.Продукти з тварин та рибна зона
    4.Вироблені продукти
    5.Руда, злитки та ювелірні вироби
    6.Будівлі
    7.Всі Інструмети
    8.Інше та поради.

    00. Вихід з режиму!

    Всі ціни наведені, це максимальні ціни придорожньої лавки 10шт.
    Ціна "14,4" - 10шт. "14,х" значення до крапки ціна 1шт.
    ''')

Cops = ('''
    Пшениця - 3,6
    Кукурудза - 7,2
    Морква - 7,2
    Соя - 10,8
    Тростина - 14,4
    Рис - 18,8
    Індіго - 25,2
    Хлопок - 28,8
    Гарбуз - 32,4
    Латук - 32,4
    Картопля - 36,0
    Перець - 36,0
    Помідор - 43,2
    Клубніка - 50,4
     ''')
TreeBush = ('''
    Кущі:
    Малина - 46,8
    Ожина - 82,8
    Кава - 64,8
    Нектар(лощина) - 68,6

    Дерева:
    Яблуня - 39,4
    Вишня - 68,4
    Какао - 86,4
    Оливка - 82,8
    Лимон -

    Більше інформації, чистий прибуток , вартість рослин у "Розширений режим"
    ''')
Animal_Fish_Product = ('''
    Продукти з загонів тварин:
    Яйце - 18,0
    Молоко Коровяче - 32,4
    Бекон Свинячий - 50,4
    Вовна - 54,0
    Козяче Молоко - 64,8

    Рибна зона:
    Рибяче філе - 54,0
    Раковий хвіст - 201,6
    Качине піря - 140,4

    ''')
FMP = ('''

    ''')
IIJ = ('''
    Срібна руда - 18.0
    Срібний злиток - 147.6

    Золота руда - 21.6
    Золотий злиток - 180.0

    Платинова руда - 32.4
    Платиновий злиток - 205.2

    Вугілля - 10.8
    Очищене вугілля - 108.0

    Жилізна руда - 14.4
    Жилізний злиток - 129.6

    Ювелірка:
    Браслет - 514.8
    Амулет - 363.6
    Діамантове кільце - 824.4
    Стальний браслет - 658.8
    ''')
build = ('''

    ''')
city = ('''

    ''')
tools = '''

    '''
load = '''

    '''
select_cops = ('''
    1.Пшениця
    2.Кукурудза
    3.Морква
    4.Соя
    5.Тростина
    6.Рис
    7.Індіго
    8.Хлопок
    9.Гарбуз
    10.Латук
    11.Картопля
    12.Перець
    13.Томат
    14.Клубніка

    0.Повернутись у попереднє меню
    ''')

GoBack = 'Нажміть "0" та "Enter" щоб повернутись у попереднє меню'
goMany = 'Вартість скількох штук вирахувати ?:'
pcs_ = 'Шт.'
cost_ = 'вартістю'
coins = 'Монет'

content = {1: Cops, 2: TreeBush, 3: Animal_Fish_Product, 4: FMP, 5: IIJ, 6: build, 7: tools, 8: load}

nameCop = {1: 'Пшениця', 2: 'Кукурудза', 3: 'Морква', 4: 'Соя',
           5: 'Тростина', 6: 'Рис', 7: 'Індіго', 8: 'Хлопок',
           9: 'Гарбуз', 10: 'Латук', 11: 'Картопля', 12: 'Перець',
           13: 'Помідор', 14: 'Клубніка'}

costCop = {'Пшениця': 36, 'Кукурудза': 72, 'Морква': 72, 'Соя': 108,
           'Тростина': 144, 'Рис': 188, 'Індіго': 252, 'Хлопок': 288,
           'Гарбуз': 324, 'Латук': 324, 'Картопля': 360, 'Перець': 360,
           'Помідор': 432, 'Клубніка': 504}
